app/controllers/appointments_controller.rb

INSERT INTO "appointments" ("user_id", "trainer_id", "time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["trainer_id", 1], ["time", "2016-06-22 00:00:00.000000"], ["created_at", "2016-06-22 19:34:49.806669"], ["updated_at", "2016-06-22 19:34:49.806669"]]
---
  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save