app/controllers/exercises_controller.rb

  def create
    @exercise = Exercise.create(appointment_id: params['appointment_id'],
                                users_id: params['user_id'],
                                name: params['name'],
                                metric: params['metric'],
                                description: params['description'])
---
INSERT INTO "exercises" ("appointment_id", "users_id", "name", "metric", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["appointment_id", 1], ["users_id", 1], ["name", "Name"], ["metric", ""], ["description", ""], ["created_at", "2016-06-23 00:35:24.855134"], ["updated_at", "2016-06-23 00:35:24.855134"]]