app/controllers/schedule_controller.rb

  def index
    @schedule = Schedule.where("time < ?", DateTime.now )
    @available_hours = []
    @schedule.each do |time|
---
SELECT "schedules".* FROM "schedules" WHERE (time < '2016-06-22 07:43:43.446207')
SELECT  "schedules".* FROM "schedules"  ORDER BY "schedules"."id" ASC LIMIT 1