app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-06-17 00:28:34.031586"], ["updated_at", "2016-06-17 00:28:34.031586"]]
---
  def create
    @user = User.new(user_params)
      if @user.save